let handler  = async (m, { conn }) => { 
    let name = conn.getName(m.sender);
    let teks = `
‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
*⎔❯╼╾╼╾╃❖⟪﷽⟫❖╃╼╾╼╾❮⎔*
*『 مــرحــبــا بــك فــي نــقــابــتــنــا 』*
                         *━──╌ •• ╌──━*
                 
املئ  الإستمـــــ📜ـــارة :
┏━━━━•❅•°•❈ - •°•❅•━━━━┓

⸙ اللقب :   【】

⸙ الأنمي المأخوذ منه اللقب :   【】

⸙ من طرف :   【】

⸙ أنثى أم ذكر :   【】 

┗━━━━•❅•°•❈ - •°•❅•━━━━┛


◉━━━─ •༺ ⛩️ ༻• ─━━━◉

> ✦¦ بـعـد ان تـمـلأ الـاسـتـمـارة قُـم بـمـنـشـنـة احـد الـمـشـرفـيـن وسـيـتـم الـرد عـلـيـك فـي اقـرب وقـت❗

> ♤¦ مــلـاحــظــات هــــامــــــة ⛔

> ① اذا مــكــثــت فــي الـاســتــقــبــال اكــثــر مــن 24 ســاعــة ســيــتــم طــردك

> ② الــقــاب الــهــنــتــاي مــمــنــوعــة

> ③ الــرقــم الــوهــمــي مــمــنــوع

> ④ مــمــنــوع أخــذ لــقــب عــكــس جــنــســك

> ④ مــمــنــوع أخــذ الــقــاب غــيــر الـأنــمــي

«🧧ـــــــــــــــــ꧁🍁꧂ــــــــــــــ🧧»
`.trim();

    conn.reply(m.chat, teks, m);
};

handler.customPrefix = /^(استمارة|استماره)$/i;
handler.command = new RegExp;

export default handler;
