let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*『𝓧𝐂𝙖𝙨𝙥𝙚𝙧𝓧*\n*❆╼━━❆ •• ❆━━╾❆*\n*『${pickRandom(global.bjssvjs)}』*\n*❆╼━━❆ •• ❆━━╾❆*`, m)
}
handler.help = ['uwvssj']
handler.tags = ['fun']
handler.command = /صراحه|صراحة|الصراحه/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.bjssvjs = [ 
    "صراحة | التقيت الناس مع وجوهين؟",
    "صراحة | شيء وكنت تحقق اللسان؟",
    "صراحة | أنا شخص ضعيف عندما؟",
    "صراحة | هل ترغب في إظهار حبك ومرفق لشخص أو رؤية هذا الضعف؟",
    "صراحة | يدل على أن الكذب مرات تكون ضرورية شي؟",
    "صراحة | أشعر بالوحدة على الرغم من أنني تحيط بك كثيرا؟",
    "صراحة | كيفية الكشف عن من يكمن عليك؟",
    "صراحة | إذا حاول شخص ما أن يكرهه أن يقترب منك ويهتم بك تعطيه فرصة؟",
    "صراحة | أشجع شيء حلو في حياتك؟",
    "صراحة | طريقة جيدة يقنع حتى لو كانت الفكرة خاطئة توافق؟",
    "صراحة | كيف تتصرف مع من يسيئون فهمك ويأخذ على ذهنه ثم ينتظر أن يرفض؟",
    "صراحة | التغيير العادي عندما يكون الشخص الذي يحبه؟",
    "صراحة | المواقف الصعبة تضعف لك ولا ترفع؟",
    "صراحة | نظرة و يفسد الصداقة؟",
    "صراحة | ‏‏إذا أحد قالك كلام سيء بالغالب وش تكون ردة فعلك؟",
    "صراحة | شخص معك بالحلوه والمُره؟",
    "صراحة | ‏هل تحب إظهار حبك وتعلقك بالشخص أم ترى ذلك ضعف؟",
    "صراحة | تأخذ بكلام اللي ينصحك ولا تسوي اللي تبي؟",
    "صراحة | وش تتمنى الناس تعرف عليك؟",
    "صراحة | ابيع المجرة عشان؟",
    "صراحة | أحيانا احس ان الناس ، كمل؟",
    "صراحة | مع مين ودك تنام اليوم؟",
    "صراحة | صدفة العمر الحلوة هي اني؟",
    "صراحة | الكُره العظيم دايم يجي بعد حُب قوي تتفق؟",
    "صراحة | صفة تحبها في نفسك؟",
    "صراحة | ‏الفقر فقر العقول ليس الجيوب ، تتفق؟",
    "صراحة | تصلي صلواتك الخمس كلها؟",
    "صراحة | ‏تجامل أحد على راحتك؟",
    "صراحة | اشجع شيء سويتة بحياتك؟",
    "صراحة | وش ناوي تسوي اليوم؟",
    "صراحة | وش شعورك لما تشوف المطر؟",
    "صراحة | غيرتك هاديه ولا تسوي مشاكل؟",
    "صراحة | ما اكثر شي ندمن عليه؟",
    "صراحة | اي الدول تتمنى ان تزورها؟",
    "صراحة | متى اخر مره بكيت؟",
    "صراحة | تقيم حظك ؟ من عشره؟",
    "صراحة | هل تعتقد ان حظك سيئ؟",
    "صراحة | شـخــص تتمنــي الإنتقــام منـــه؟",
    "صراحة | كلمة تود سماعها كل يوم؟",
    "صراحة | **هل تُتقن عملك أم تشعر بالممل؟",
    "صراحة | هل قمت بانتحال أحد الشخصيات لتكذب على من حولك؟",
    "صراحة | متى آخر مرة قمت بعمل مُشكلة كبيرة وتسببت في خسائر؟",
    "صراحة | ما هو اسوأ خبر سمعته بحياتك؟",
    "‏صراحة | هل جرحت شخص تحبه من قبل ؟",
    "صراحة | ما هي العادة التي تُحب أن تبتعد عنها؟",
    "‏صراحة | هل تحب عائلتك ام تكرههم؟",
    "‏صراحة | من هو الشخص الذي يأتي في قلبك بعد الله – سبحانه وتعالى- ورسوله الكريم – صلى الله عليه وسلم؟",
    "‏صراحة | هل خجلت من نفسك من قبل؟",
    "‏صراحة | ما هو ا الحلم  الذي لم تستطيع ان تحققه؟",
    "‏صراحة | ما هو الشخص الذي تحلم به كل ليلة؟",
    "‏صراحة | هل تعرضت إلى موقف مُحرج جعلك تكره صاحبهُ؟",
    "‏صراحة | هل قمت بالبكاء أمام من تُحب؟",
    "‏صراحة | ماذا تختار حبيبك أم صديقك؟",
    "‏صراحة | هل حياتك سعيدة أم حزينة؟",
    "صراحة | ما هي أجمل سنة عشتها بحياتك؟",
    "‏صراحة | ما هو عمرك الحقيقي؟",
    "‏صراحة | ما اكثر شي ندمن عليه؟",
    "صراحة | ما هي أمنياتك المُستقبلية؟‏",
   
 ] 
